[
  {
    "id": "8405",
    "condition": "(О. Лысенков) Геймер Генадий решил написать пост о своих любимых играх, используя кодировку, в которой каждый символ кодируется с помощью 1 байта. Он начал пост со следующего предложения: <br/><pre>  Minecraft, Dota, Tetris, Rust, Valorant, Fortnite, Among Us, GTA — мои любимые игры. </pre>Затем он, подумав, удалил название одной игры из списка, также он удалил запятую и лишний пробел (два пробела не должны идти подряд). При этом информационный объём текста в данной кодировке оказался на 6 байт меньше, чем информационный объём исходного предложения. Напишите в ответе слово, которое удалил Генадий. Если подходящих слов несколько, выберите самое первое из них.",
    "answer": "Dota"
  },
  {
    "id": "8404",
    "condition": "(О. Лысенков) В одной кодировке Windows-1251 каждый символ кодируется 8 битами. Августина в чат со своими одноклассниками написала текст (В нем нет лишних пробелов):<br/><pre>  Вайб, чилл, рофл, лул, кринж, токс, флекс, треш и — это наш язык. </pre>Августина заметила, что поставила пробел после буквы «и», но забыла записать еще одно слово. Она вернулась и дописала слово, поставив после слова ещё один пробел. После добавления объем текста оказался на 6 байт больше. Напишите в ответе, из скольких символов состояло добавленное слово.",
    "answer": "5"
  },
  {
    "id": "8403",
    "condition": "*(О. Лысенков) Cтатья, набранная на компьютере, содержит 16 страниц. На каждой странице 45 строк, в каждой строке 35 символов. Определите целое минимальное целое количество килобайт, в которое поместится данный текст, если известно, что текст был записан в одной из кодировок Unicode, где каждый символ кодируется 16 битами.",
    "answer": "50"
  },
  {
    "id": "8402",
    "condition": "*(О. Лысенков) Статья, набранная на компьютере, содержит 4096 страниц. На каждой странице 8388608 (223) строк, в каждой строке 32768 (215) символов. Текст был записан с использованием кодировки КОИ-8, в которой каждый символ кодируется 8 битами. Определите информационный объем статьи в Тбайтах (Терабайтах).",
    "answer": "1024"
  },
  {
    "id": "8391",
    "condition": "*(О. Лысенков) Статья, набранная на компьютере, содержит 320 страниц. На каждой странице 100 строк, на каждой строке X символов. Текст был записан с использованием кодировки UTF-32, в которой каждый символ занимает 32 бита. Известно, что информационный объем текста не превышает 4800 Кбайт. Какое максимальное количество символов находится на одной строке, если известно, что количество символов в одной строке на всех страницах одинаково?",
    "answer": "38"
  },
  {
    "id": "8390",
    "condition": "(О. Лысенков) В одной из кодировок Unicode каждый символ кодируется 16 битами. Николаю был дан текст, в котором нет лишних пробелов. Николай добавил в текст слово из 4 символов и один пробел. Определите информационный объем исходного текста в байтах, если информационный объем текста после добавления слова и пробела стал равным 180 байт.",
    "answer": "170"
  },
  {
    "id": "8389",
    "condition": "(О. Лысенков) Вова вчера пережил целую эмоциональную драму: сначала вайб, потом кринж, потом вообще ушёл в себя. Утром он конечно же решил поделиться пережитым со своими подписчиками и написал в своём Telegram-канале:<br/><pre>  Радость, угар, тревога, скука, ностальгия, обида, душ, вайб — всё это про меня вчера.<br/></pre>Потом перечитал и решил: «Нет, * — это перебор». Удалил слово «*» и прибрал за собой — убрал запятую и лишний пробел. В итоге информационный объём текста стал меньше на 6 байт. Какое чувство Вова вычеркнул из текста, если каждый символ кодировался 8 битами? Напишите в ответе вычеркнутое слово. Если таких слов может быть несколько, то напишите в ответе самое ближнее к концу текста слово.",
    "answer": "вайб"
  },
  {
    "id": "8388",
    "condition": "(О. Лысенков) В одной из кодировок каждый символ кодируется 16 битами. В данной кодировке записали следующее сообщение:<br/><pre>  Не существует причин, оправдывающих чье-либо убийство.<br/></pre>После этого данный текст записали в другой кодировке, где каждый символ кодируется 8 битами. На сколько байт уменьшился информационный объём сообщения?",
    "answer": "54"
  },
  {
    "id": "8361",
    "condition": "*(О. Лысенков) Профессор Душнилкин писал книгу о клиповом мышлении. У него получилась книга на 200 страниц без единой картинки, на каждой странице было 40 строк, а в каждой строке в среднем 48 символов. Этот текст был сохранён в кодировке Unicode, где каждый символ кодируется 16 битами. Определите информационный объём текста в килобайтах.",
    "answer": "750"
  },
  {
    "id": "8360",
    "condition": "(О. Лысенков) В одной из кодировок Unicode каждый символ кодируется 32 битами. Максим написал текст (в нем нет лишних пробелов):<br/><pre>  Iphone, Xiaomi, Huawei, Honor, Vivo, Poco – известные бренды смартфонов.<br/></pre>Максим добавил в данный текст слово из 7 символов. Кроме того, он добавил необходимые запятую и пробел. После этого он удалил одно слово, а также запятую и пробел перед ним. Известно, что ученик вычеркнул не то слово, которое он добавил. Информационный объём нового предложения стал на 8 байт больше, чем объём исходного предложения. Напишите в ответе вычеркнутое слово.",
    "answer": "Honor"
  },
  {
    "id": "8359",
    "condition": "(О. Лысенков) В одной из кодировок КОИ-8 каждый символ кодируется 8 битами. Иван написал текст (в нем нет лишних пробелов):<br/><pre>  Python, Java, C++, Ruby, PHP, Go, Rust – популярные языки программирования.<br/></pre>Иван удалил из списка название одного языка, а также лишние запятую и пробел (два пробела не должны идти подряд). При этом размер нового предложения в данной кодировке оказался на 6 байт меньше, чем размер исходного предложения. Напишите в ответе вычеркнутое слово. Если таких слов может быть несколько, то напишите в ответе самое ближнее к концу текста слово",
    "answer": "Rust"
  },
  {
    "id": "8358",
    "condition": "(О. Лысенков) Игорь написал в текстовом редакторе доклад о книге \"Властелин колец\", в этом докладе была следующая строчка:<br/><pre>  Фродо, Сэм, Арагорн, Леголас, Гимли, Гэндальф, Боромир, Мери, Пиппин, Саурон – герои Средиземья.<br/></pre>Игорь в процессе проверки текста понял, что Саурон в этот список не подходит, так как он злодей, а не герой. Поэтому Игорь удалил его имя, а также лишнюю запятую, а вот пробел забыл удалить. Напишите на сколько байт информационный объём нового предложения меньше, чем объём исходного, если каждый символ кодируется 8 битами. В ответе запишите только число байт, самую единицу измерения писать не нужно.",
    "answer": "7"
  },
  {
    "id": "8357",
    "condition": "(О. Лысенков) В кодировке Windows-1251 каждый символ кодируется 8 битами. Вова хотел написать текст (в нём нет лишних пробелов):<br/><pre>  Ом, Бор, Кюри, Попов, Джоуль, Рентген, Курчатов, Резерфорд – великие физики.<br/></pre>Но в итоге фамилию одного учёного он написал два раза подряд, добавив необходимые запятую и пробел (два пробела не должны идти подряд). При этом размер написанного предложения в данной кодировке оказался на 6 байт больше, чем размер нужного предложения. Напишите в ответе слово, использованное дважды.",
    "answer": "Кюри"
  },
  {
    "id": "8356",
    "condition": "(О. Лысенков) В одной из кодировок каждый символ кодируется 16 битами. Артемий написал в блоге про погоду:<br/><pre>  Моросящий, ливневый, тёплый, холодный, ночной, утренний, грибной – виды дождя. <br/></pre>Потом вспомнил, что забыл про проливной, и добавил слово \"проливной\" с запятой и пробелом (два пробела не должны идти подряд). Напишите в ответе насколько байт информационный объём нового сообщения больше, чем объём исходного.",
    "answer": "22"
  },
  {
    "id": "8343",
    "condition": "*(С. Сергеев) Ученик увидел одну из техник по запоминанию текста, в которой два самых длинных слова дублируются. Он также решил попробовать данную технику и продублировал во фразе <br/><pre>  Я не провалил тест. Я просто нашел сто способов написать его неправильно.<br/></pre>два самых длинных слова, поставив между одинаковыми словами по одному пробелу. Известно, что информационный объём текста увеличился на 504 бита. Определите количество бит, которое выделяется на один символ в данной кодировке.",
    "answer": "24"
  },
  {
    "id": "8342",
    "condition": "*(С. Сергеев) Ученик увидел одну из техник по запоминанию текста, в которой два самых длинных слова дублируются. Он также решил попробовать данную технику и продублировал во фразе <br/><pre>  Лучше быть уверенным в хорошем результате, чем надеяться на отличный.<br/></pre>два самых длинных слова, поставив между одинаковыми словами по одному пробелу. Известно, что информационный объём текста увеличился на 336 бит. Определите количество байт, которое выделяется на один символ в данной кодировке.",
    "answer": "2"
  },
  {
    "id": "8341",
    "condition": "*(С. Сергеев) Ученик увидел одну из техник по запоминанию текста, в которой два самых длинных слова дублируются. Он также решил попробовать данную технику и продублировал во фразе <br/><pre>  Самое главное всегда впереди.<br/></pre>два самых длинных слова, поставив между одинаковыми словами по одному пробелу. Известно, что информационный объём текста увеличился на 128 бит. Определите количество байт, которое выделяется на один символ в данной кодировке.",
    "answer": "1"
  },
  {
    "id": "8340",
    "condition": "*(С. Сергеев) Ученик увидел одну из техник по запоминанию текста, в которой каждый n-й символ из фрагмента дублируется. Он также решил попробовать данную технику и продублировал каждый n-й символ во фразе <br/><pre>  Я не провалил тест. Я просто нашел сто способов написать его неправильно.<br/></pre>Известно, что каждый символ занимает в памяти 8 бит, при этом размер измененной фразы в данной кодировке составил 728 бит. Определите максимально возможное значение n.",
    "answer": "4"
  },
  {
    "id": "8339",
    "condition": "*(С. Сергеев) Ученик увидел одну из техник по запоминанию текста, в которой каждый n-й символ из фрагмента дублируется. Он также решил попробовать данную технику и продублировал каждый n-й символ во фразе <br/><pre>  Лучше быть уверенным в хорошем результате, чем надеяться на отличный.<br/></pre>Известно, что каждый символ занимает в памяти 8 бит, при этом размер измененной фразы в данной кодировке составил 576 бит. Определите максимально возможное значение n.",
    "answer": "17"
  },
  {
    "id": "8338",
    "condition": "*(С. Сергеев) Ученик увидел одну из техник по запоминанию текста, в которой каждый n-й символ из фрагмента дублируется. Он также решил попробовать данную технику и продублировал каждый n-й символ во фразе <br/><pre>  Самое крутое всегда впереди.<br/></pre>Известно, что каждый символ занимает в памяти 16 бит, при этом размер измененной фразы в данной кодировке составил 480 бит. Определите максимально возможное значение n.",
    "answer": "14"
  },
  {
    "id": "8337",
    "condition": "(С. Сергеев) Ученик увидел одну из техник по запоминанию текста, в которой каждый шестой символ из фрагмента вычеркивается. Он также решил попробовать данную технику и вычеркнул из фразы <br/><pre>  Я не провалил тест. Я просто нашел сто способов написать его неправильно.<br/></pre>каждый шестой символ. Известно, что каждый символ занимает в памяти 24 бита. Определите, сколько байт ему удастся сэкономить.",
    "answer": "36"
  },
  {
    "id": "8336",
    "condition": "(С. Сергеев) Ученик увидел одну из техник по запоминанию текста, в которой каждый четвёртый символ из фрагмента вычеркивается. Он также решил попробовать данную технику и вычеркнул из фразы <br/><pre>  Лучше быть уверенным в хорошем результате, чем надеяться на отличный.<br/></pre>каждый четвёртый символ. Известно, что каждый символ занимает в памяти 16 бит. Определите, сколько байт ему удастся сэкономить.",
    "answer": "34"
  },
  {
    "id": "8335",
    "condition": "(С. Сергеев) Ученик увидел одну из техник по запоминанию текста, в которой каждый третий символ из фрагмента вычеркивается. Он также решил попробовать данную технику и вычеркнул из фразы <br/><pre>  Самое крутое всегда впереди.<br/></pre>каждый третий символ. Известно, что каждый символ занимает в памяти 1 байт. Определите, сколько бит ему удастся сэкономить.",
    "answer": "72"
  },
  {
    "id": "8207",
    "condition": "*(С. Сергеев) Студентка Евлампия набирала статью по теме «Компьютерная безопасность». Она успела набрать 30 страниц, на каждой странице 20 строк и в каждой строке 48 символов. Известно, что она загрузила данный файл в интернет за 2 минуты, а скорость передачи составляла 1440 бит/с. Придя домой, она решила изменить статью. Евлампия поменяла кодировку, после чего вес одного символа увеличился на 50%, а также дописала оставшуюся часть статьи. Итоговый вес статьи увеличился вдвое. Определите, сколько полных минут пришлось бы заново перепечатывать статью Евлампии, если Евлампия печатает со скоростью 5 символов в секунду.",
    "answer": "128"
  },
  {
    "id": "1103",
    "condition": "В одной из кодировок каждый символ кодируется 8 битами. Вова написал текст (в нём нет лишних пробелов):<br/><pre>  «Фиалка, лютик, роза, гвоздика, мак, хризантема, <br/>   гладиолус – это цветы».</pre>Затем он добавил в список название ещё одного растения. Заодно он добавил необходимые запятые и пробелы. При этом размер нового предложения в данной кодировке оказался на 11 байт больше, чем размер исходного предложения. Напишите в ответе длину добавленного названия растения в символах.",
    "answer": "9"
  },
  {
    "id": "1102",
    "condition": "В одной из кодировок каждый символ кодируется 8 битами. Вова написал текст (в нём нет лишних пробелов):<br/><pre>  «Фиалка, лютик, роза, гвоздика, мак, хризантема, <br/>   гладиолус – это цветы».</pre>Затем он добавил в список название ещё одного растения. Заодно он добавил необходимые запятые и пробелы. При этом размер нового предложения в данной кодировке оказался на 10 байт больше, чем размер исходного предложения. Напишите в ответе длину добавленного названия растения в символах.",
    "answer": "8"
  },
  {
    "id": "1101",
    "condition": "В одной из кодировок каждый символ кодируется 8 битами. Вова написал текст (в нём нет лишних пробелов):<br/><pre>  «Фиалка, лютик, роза, гвоздика, мак, хризантема, <br/>   гладиолус – это цветы».</pre>Затем он добавил в список название ещё одного растения. Заодно он добавил необходимые запятые и пробелы. При этом размер нового предложения в данной кодировке оказался на 9 байт больше, чем размер исходного предложения. Напишите в ответе длину добавленного названия растения в символах.",
    "answer": "7"
  },
  {
    "id": "1100",
    "condition": "В одной из кодировок каждый символ кодируется 8 битами. Вова написал текст (в нём нет лишних пробелов):<br/><pre>  «Фиалка, лютик, роза, гвоздика, мак, хризантема, <br/>   гладиолус – это цветы».</pre>Затем он добавил в список название ещё одного растения. Заодно он добавил необходимые запятые и пробелы. При этом размер нового предложения в данной кодировке оказался на 8 байт больше, чем размер исходного предложения. Напишите в ответе длину добавленного названия растения в символах.",
    "answer": "6"
  },
  {
    "id": "1099",
    "condition": "В одной из кодировок каждый символ кодируется 8 битами. Вова написал текст (в нём нет лишних пробелов):<br/><pre>  «Фиалка, лютик, роза, гвоздика, мак, хризантема, <br/>   гладиолус – это цветы».</pre>Затем он добавил в список название ещё одного растения. Заодно он добавил необходимые запятые и пробелы. При этом размер нового предложения в данной кодировке оказался на 7 байт больше, чем размер исходного предложения. Напишите в ответе длину добавленного названия растения в символах.",
    "answer": "5"
  },
  {
    "id": "1098",
    "condition": "В одной из кодировок каждый символ кодируется 8 битами. Вова написал текст (в нём нет лишних пробелов):<br/><pre>  «Фиалка, лютик, роза, гвоздика, мак, хризантема, <br/>   гладиолус – это цветы».</pre>Затем он добавил в список название ещё одного растения. Заодно он добавил необходимые запятые и пробелы. При этом размер нового предложения в данной кодировке оказался на 6 байт больше, чем размер исходного предложения. Напишите в ответе длину добавленного названия растения в символах.",
    "answer": "4"
  },
  {
    "id": "1097",
    "condition": "В одной из кодировок каждый символ кодируется 8 битами. Вова написал текст (в нём нет лишних пробелов):<br/><pre>  «Фиалка, лютик, роза, гвоздика, мак, хризантема, <br/>   гладиолус – это цветы».</pre>Затем он добавил в список название ещё одного растения. Заодно он добавил необходимые запятые и пробелы. При этом размер нового предложения в данной кодировке оказался на 5 байт больше, чем размер исходного предложения. Напишите в ответе длину добавленного названия растения в символах.",
    "answer": "3"
  },
  {
    "id": "1096",
    "condition": "В одной из кодировок каждый символ кодируется 8 битами. Вова написал текст (в нём нет лишних пробелов):<br/><pre>  «Фиалка, лютик, роза, гвоздика, мак, хризантема, <br/>   гладиолус – это цветы».</pre>Затем он добавил в список название ещё одного растения. Заодно он добавил необходимые запятые и пробелы. При этом размер нового предложения в данной кодировке оказался на 4 байта больше, чем размер исходного предложения. Напишите в ответе длину добавленного названия растения в символах.",
    "answer": "2"
  },
  {
    "id": "1095",
    "condition": "В одной из кодировок Unicode каждый символ кодируется 16 битами. Вова написал текст (в нём нет лишних пробелов):<br/><pre>  «Собака, кошка, курица, корова, лошадь, коза, <br/>   овца – домашние животные».</pre>Затем он добавил в список название ещё одного животного. Заодно он добавил необходимые запятые и пробелы. При этом размер нового предложения в данной кодировке оказался на 18 байт больше, чем размер исходного предложения. Напишите в ответе длину добавленного названия животного в символах.",
    "answer": "7"
  },
  {
    "id": "1094",
    "condition": "В одной из кодировок Unicode каждый символ кодируется 16 битами. Вова написал текст (в нём нет лишних пробелов):<br/><pre>  «Собака, кошка, курица, корова, лошадь, коза, <br/>   овца – домашние животные».</pre>Затем он добавил в список название ещё одного животного. Заодно он добавил необходимые запятые и пробелы. При этом размер нового предложения в данной кодировке оказался на 16 байт больше, чем размер исходного предложения. Напишите в ответе длину добавленного названия животного в символах.",
    "answer": "6"
  },
  {
    "id": "1093",
    "condition": "В одной из кодировок Unicode каждый символ кодируется 16 битами. Вова написал текст (в нём нет лишних пробелов):<br/><pre>  «Собака, кошка, курица, корова, лошадь, коза, <br/>   овца – домашние животные».</pre>Затем он добавил в список название ещё одного животного. Заодно он добавил необходимые запятые и пробелы. При этом размер нового предложения в данной кодировке оказался на 14 байт больше, чем размер исходного предложения. Напишите в ответе длину добавленного названия животного в символах.",
    "answer": "5"
  },
  {
    "id": "1092",
    "condition": "В одной из кодировок Unicode каждый символ кодируется 16 битами. Вова написал текст (в нём нет лишних пробелов):<br/><pre>  «Собака, кошка, курица, корова, лошадь, коза, <br/>   овца – домашние животные».</pre>Затем он добавил в список название ещё одного животного. Заодно он добавил необходимые запятые и пробелы. При этом размер нового предложения в данной кодировке оказался на 12 байт больше, чем размер исходного предложения. Напишите в ответе длину добавленного названия животного в символах.",
    "answer": "4"
  },
  {
    "id": "1091",
    "condition": "В одной из кодировок Unicode каждый символ кодируется 16 битами. Вова написал текст (в нём нет лишних пробелов):<br/><pre>  «Собака, кошка, курица, корова, лошадь, коза, <br/>   овца – домашние животные».</pre>Затем он добавил в список название ещё одного животного. Заодно он добавил необходимые запятые и пробелы. При этом размер нового предложения в данной кодировке оказался на 10 байт больше, чем размер исходного предложения. Напишите в ответе длину добавленного названия животного в символах.",
    "answer": "3"
  },
  {
    "id": "1090",
    "condition": "В одной из кодировок Unicode каждый символ кодируется 16 битами. Вова написал текст (в нём нет лишних пробелов):<br/><pre>  «Собака, кошка, курица, корова, лошадь, коза, <br/>   овца – домашние животные».</pre>Затем он добавил в список название ещё одного животного. Заодно он добавил необходимые запятые и пробелы. При этом размер нового предложения в данной кодировке оказался на 8 байт больше, чем размер исходного предложения. Напишите в ответе длину добавленного названия животного в символах.",
    "answer": "2"
  },
  {
    "id": "1089",
    "condition": "В одной из кодировок каждый символ кодируется 8 битами. Вова написал текст (в нём нет лишних пробелов):<br/><pre>  «Белка, сурок, слон, медведь, газель, ягуар, крокодил, <br/>   аллигатор – дикие животные».</pre>Затем он вычеркнул из списка название одного из животных. Заодно он вычеркнул ставшие лишними запятые и пробелы – два пробела не должны идти подряд. При этом размер нового предложения в данной кодировке оказался на 11 байт меньше, чем размер исходного предложения. Напишите в ответе вычеркнутое название животного.",
    "answer": "аллигатор"
  },
  {
    "id": "1088",
    "condition": "В одной из кодировок каждый символ кодируется 8 битами. Вова написал текст (в нём нет лишних пробелов):<br/><pre>  «Белка, сурок, слон, медведь, газель, ягуар, крокодил, <br/>   аллигатор – дикие животные».</pre>Затем он вычеркнул из списка название одного из животных. Заодно он вычеркнул ставшие лишними запятые и пробелы – два пробела не должны идти подряд. При этом размер нового предложения в данной кодировке оказался на 10 байт меньше, чем размер исходного предложения. Напишите в ответе вычеркнутое название животного.",
    "answer": "крокодил"
  },
  {
    "id": "1087",
    "condition": "В одной из кодировок каждый символ кодируется 8 битами. Вова написал текст (в нём нет лишних пробелов):<br/><pre>  «Белка, сурок, слон, енот, газель, носорог, крокодил, <br/>   аллигатор – дикие животные».</pre>Затем он вычеркнул из списка название одного из животных. Заодно он вычеркнул ставшие лишними запятые и пробелы – два пробела не должны идти подряд. При этом размер нового предложения в данной кодировке оказался на 9 байт меньше, чем размер исходного предложения. Напишите в ответе вычеркнутое название животного.",
    "answer": "носорог"
  },
  {
    "id": "1086",
    "condition": "В одной из кодировок каждый символ кодируется 8 битами. Вова написал текст (в нём нет лишних пробелов):<br/><pre>  «Белка, сурок, слон, медведь, газель, носорог, крокодил, <br/>   аллигатор – дикие животные».</pre>Затем он вычеркнул из списка название одного из животных. Заодно он вычеркнул ставшие лишними запятые и пробелы – два пробела не должны идти подряд. При этом размер нового предложения в данной кодировке оказался на 8 байт меньше, чем размер исходного предложения. Напишите в ответе вычеркнутое название животного.",
    "answer": "газель"
  },
  {
    "id": "1085",
    "condition": "В одной из кодировок каждый символ кодируется 8 битами. Вова написал текст (в нём нет лишних пробелов):<br/><pre>  «Заяц, сурок, слон, медведь, тюлень, носорог, крокодил, <br/>   аллигатор – дикие животные».</pre>Затем он вычеркнул из списка название одного из животных. Заодно он вычеркнул ставшие лишними запятые и пробелы – два пробела не должны идти подряд. При этом размер нового предложения в данной кодировке оказался на 7 байт меньше, чем размер исходного предложения. Напишите в ответе вычеркнутое название животного.",
    "answer": "сурок"
  },
  {
    "id": "1084",
    "condition": "В одной из кодировок каждый символ кодируется 8 битами. Вова написал текст (в нём нет лишних пробелов):<br/><pre>  «Барсук, сурок, слон, олень, тюлень, носорог, крокодил, <br/>   аллигатор – дикие животные».</pre>Затем он вычеркнул из списка название одного из животных. Заодно он вычеркнул ставшие лишними запятые и пробелы – два пробела не должны идти подряд. При этом размер нового предложения в данной кодировке оказался на 6 байт меньше, чем размер исходного предложения. Напишите в ответе вычеркнутое название животного.",
    "answer": "слон"
  },
  {
    "id": "1083",
    "condition": "В одной из кодировок каждый символ кодируется 8 битами. Вова написал текст (в нём нет лишних пробелов):<br/><pre>  «Заяц, лев, слон, олень, тюлень, носорог, крокодил, <br/>   аллигатор – дикие животные».</pre>Затем он вычеркнул из списка название одного из животных. Заодно он вычеркнул ставшие лишними запятые и пробелы – два пробела не должны идти подряд. При этом размер нового предложения в данной кодировке оказался на 5 байт меньше, чем размер исходного предложения. Напишите в ответе вычеркнутое название животного.",
    "answer": "лев"
  },
  {
    "id": "1082",
    "condition": "В одной из кодировок каждый символ кодируется 8 битами. Вова написал текст (в нём нет лишних пробелов):<br/><pre>  «Лев, еж, слон, олень, тюлень, носорог, крокодил, <br/>   аллигатор – дикие животные».</pre>Затем он вычеркнул из списка название одного из животных. Заодно он вычеркнул ставшие лишними запятые и пробелы – два пробела не должны идти подряд. При этом размер нового предложения в данной кодировке оказался на 4 байта меньше, чем размер исходного предложения. Напишите в ответе вычеркнутое название животного.",
    "answer": "еж"
  },
  {
    "id": "1081",
    "condition": "В одной из кодировок Unicode каждый символ кодируется 16 битами. Вова написал текст (в нём нет лишних пробелов):<br/><pre>  «Заяц, волк, хорёк, суслик, лама, медведь, гиена, <br/>   аллигатор – дикие животные».</pre>Затем он вычеркнул из списка название одного из животных. Заодно он вычеркнул ставшие лишними запятые и пробелы – два пробела не должны идти подряд. При этом размер нового предложения в данной кодировке оказался на 22 байта меньше, чем размер исходного предложения. Напишите в ответе вычеркнутое название животного.",
    "answer": "аллигатор"
  },
  {
    "id": "1080",
    "condition": "В одной из кодировок Unicode каждый символ кодируется 16 битами. Вова написал текст (в нём нет лишних пробелов):<br/><pre>  «Заяц, белка, рысь, олень, лама, носорог, крокодил, <br/>   аллигатор – дикие животные».</pre>Затем он вычеркнул из списка название одного из животных. Заодно он вычеркнул ставшие лишними запятые и пробелы – два пробела не должны идти подряд. При этом размер нового предложения в данной кодировке оказался на 20 байт меньше, чем размер исходного предложения. Напишите в ответе вычеркнутое название животного.",
    "answer": "крокодил"
  },
  {
    "id": "1079",
    "condition": "В одной из кодировок Unicode каждый символ кодируется 16 битами. Вова написал текст (в нём нет лишних пробелов):<br/><pre>  «Заяц, белка, рысь, олень, лама, носорог, крокодил, <br/>   аллигатор – дикие животные».</pre>Затем он вычеркнул из списка название одного из животных. Заодно он вычеркнул ставшие лишними запятые и пробелы – два пробела не должны идти подряд. При этом размер нового предложения в данной кодировке оказался на 18 байт меньше, чем размер исходного предложения. Напишите в ответе вычеркнутое название животного.",
    "answer": "носорог"
  },
  {
    "id": "1078",
    "condition": "В одной из кодировок Unicode каждый символ кодируется 16 битами. Вова написал текст (в нём нет лишних пробелов):<br/><pre>  «Тапир, ягуар, черепаха, олень, тюлень, носорог, крокодил, <br/>   аллигатор – дикие животные».</pre>Затем он вычеркнул из списка название одного из животных. Заодно он вычеркнул ставшие лишними запятые и пробелы – два пробела не должны идти подряд. При этом размер нового предложения в данной кодировке оказался на 16 байт меньше, чем размер исходного предложения. Напишите в ответе вычеркнутое название животного.",
    "answer": "тюлень"
  },
  {
    "id": "1077",
    "condition": "В одной из кодировок Unicode каждый символ кодируется 16 битами. Вова написал текст (в нём нет лишних пробелов):<br/><pre>  «Медведь, тигр, слон, варан, тюлень, носорог, крокодил, <br/>   аллигатор – дикие животные».</pre>Затем он вычеркнул из списка название одного из животных. Заодно он вычеркнул ставшие лишними запятые и пробелы – два пробела не должны идти подряд. При этом размер нового предложения в данной кодировке оказался на 14 байт меньше, чем размер исходного предложения. Напишите в ответе вычеркнутое название животного.",
    "answer": "варан"
  },
  {
    "id": "1076",
    "condition": "В одной из кодировок Unicode каждый символ кодируется 16 битами. Вова написал текст (в нём нет лишних пробелов):<br/><pre>  «Ёж, лев, слон, олень, тюлень, носорог, крокодил, <br/>   аллигатор – дикие животные».</pre>Затем он вычеркнул из списка название одного из животных. Заодно он вычеркнул ставшие лишними запятые и пробелы – два пробела не должны идти подряд. При этом размер нового предложения в данной кодировке оказался на 12 байт меньше, чем размер исходного предложения. Напишите в ответе вычеркнутое название животного.",
    "answer": "слон"
  },
  {
    "id": "1075",
    "condition": "В одной из кодировок Unicode каждый символ кодируется 16 битами. Вова написал текст (в нём нет лишних пробелов):<br/><pre>  «Ёж, лев, слон, олень, тюлень, носорог, крокодил, <br/>   аллигатор – дикие животные».</pre>Затем он вычеркнул из списка название одного из животных. Заодно он вычеркнул ставшие лишними запятые и пробелы – два пробела не должны идти подряд. При этом размер нового предложения в данной кодировке оказался на 10 байт меньше, чем размер исходного предложения. Напишите в ответе вычеркнутое название животного.",
    "answer": "лев"
  },
  {
    "id": "1074",
    "condition": "В одной из кодировок Unicode каждый символ кодируется 16 битами. Вова написал текст (в нём нет лишних пробелов):<br/><pre>  «Лев, еж, слон, олень, тюлень, носорог, крокодил, <br/>   аллигатор – дикие животные».</pre>Затем он вычеркнул из списка название одного из животных. Заодно он вычеркнул ставшие лишними запятые и пробелы – два пробела не должны идти подряд. При этом размер нового предложения в данной кодировке оказался на 8 байт меньше, чем размер исходного предложения. Напишите в ответе вычеркнутое название животного.",
    "answer": "еж"
  },
  {
    "id": "594",
    "condition": "Ученик набирает доклад по биологии на компьютере, используя кодировку KOI-8. Каждый символ в кодировке KOI-8 занимает 1 байт памяти. Определите какой объем памяти в битах займет следующая фраза:<br/><pre>Молекулы состоят из атомов!</pre>",
    "answer": "216"
  },
  {
    "id": "593",
    "condition": "Ученик набирает сочинение по литературе на компьютере, используя кодировку KOI-8. Каждый символ в кодировке KOI-8 занимает 8 бит памяти. Определите какой объём памяти в байтах займёт следующая фраза:<br/><pre>Пушкин - это наше всё!</pre>",
    "answer": "22"
  },
  {
    "id": "592",
    "condition": "В одном из изданий книги М.А. Булгакова «Мастер и Маргарита» 256 страниц. Какой объём памяти (в Мбайтах) заняла бы эта книга, если бы Михаил Афанасьевич набирал её на компьютере и сохранял текст в одном из представлений Unicode, в котором каждый символ занимает 16 бит памяти? На одной странице помещается 64 строки, а в строке 64 символа.",
    "answer": "2"
  },
  {
    "id": "591",
    "condition": "В одном из изданий книги Л.H. Толстого «Война и Мир» 1024 страницы. Какой объём памяти (в Мбайтах) заняла бы эта книга, если бы Лев Николаевич набирал её на компьютере в кодировке KOI-8? На одной странице помещается 64 строки, а в строке помещается 64 символа. Каждый символ в кодировке KOI-8 занимает 8 бит памяти.",
    "answer": "4"
  },
  {
    "id": "590",
    "condition": "Для получения годовой оценки по истории ученику требовалось написать доклад на 16 страниц. Выполняя это задание на компьютере, он набирал текст в кодировке Windows. Какой объём памяти (в Кбайтах) займет доклад, если в каждой строке по 64 символа, а на каждой странице помещается 64 строки? Каждый символ в кодировке Windows занимает 8 бит памяти.",
    "answer": "64"
  },
  {
    "id": "589",
    "condition": "Для получения годовой оценки по МХК ученику требовалось написать доклад на 8 страниц. Выполняя это задание на компьютере, он набирал текст в кодировке Unicode. Какой объём памяти (в Кбайтах) займет доклад, если в каждой строке по 32 символа, а на каждой странице помещается 64 строки? Каждый символ в кодировке Unicode занимает 16 бит памяти.",
    "answer": "32"
  },
  {
    "id": "588",
    "condition": "Статья, набранная на компьютере, содержит 16 страниц, на каждой странице 40 строк, в каждой строке 64 символа. Определите информационный объем статьи в Кбайтах, если документ представлен в кодировке КОИ-8 (каждый символ занимает 8 бит памяти).",
    "answer": "40"
  },
  {
    "id": "587",
    "condition": "Статья, набранная на компьютере, содержит 10 страниц, на каждой странице 32 строки, в каждой строке 56 символов. В одном из представлений Unicode каждый символ кодируется 2 байтами. Определите информационный объём статьи в Кбайтах в этом варианте представления Unicode.",
    "answer": "35"
  },
  {
    "id": "586",
    "condition": "Информационный объём статьи 60 Кбайт. Сколько страниц займет статья, если на одной странице электронного документа помещается 24 строки по 80 символов, а каждый символ представлен кодировке Unicode (в кодировке Unicode каждый символ занимает 16 бит памяти)?",
    "answer": "16"
  },
  {
    "id": "585",
    "condition": "Информационный объём статьи 48 Кбайт. Сколько страниц займет статья, если на одной странице электронного документа помещается 64 строки по 64 символа, а каждый символ представлен кодировке KOI-8 (в кодировке KOI-8 каждый символ занимает 8 бит памяти)?",
    "answer": "12"
  },
  {
    "id": "584",
    "condition": "В одной из кодировок Unicode каждый символ кодируется 16 битами. Определите размер в байтах следующего предложения в данной кодировке: <br/><pre>Семь раз отмерь, один раз отрежь!</pre>",
    "answer": "66"
  },
  {
    "id": "583",
    "condition": "Рассказ, набранный на компьютере, содержит 8 страниц, на каждой странице 40 строк, в каждой строке 48 символов. Определите информационный объём рассказа в байтах в кодировке Windows, в которой каждый символ кодируется 8 битами.",
    "answer": "15360"
  },
  {
    "id": "582",
    "condition": "Статья, набранная на компьютере, содержит 16 страниц, на каждой странице 40 строк, в каждой строке 40 символов. Определите информационный объём статьи в Кбайтах в одной из кодировок Unicode, в которой каждый символ кодируется 16 битами.",
    "answer": "50"
  },
  {
    "id": "581",
    "condition": "Статья, набранная на компьютере, содержит 8 страниц, на каждой странице 40 строк, в каждой строке 64 символа. В одном из представлений Unicode каждый символ кодируется 16 битами. Определите информационный объём в Кбайтах статьи в этом варианте представления Unicode.",
    "answer": "40"
  },
  {
    "id": "580",
    "condition": "Статья, набранная на компьютере, содержит 32 страницы, на каждой странице 32 строки, в каждой строке 25 символов. Определите информационный объём статьи в Кбайтах в кодировке Windows-1251, в которой каждый символ кодируется 8 битами.",
    "answer": "25"
  },
  {
    "id": "579",
    "condition": "В одном из вариантов кодировки Unicode на каждый символ отводится 2 байта. Определите информационный объём в битах слова из 24 символов в этой кодировке.",
    "answer": "384"
  },
  {
    "id": "578",
    "condition": "В одном из вариантов кодировки Unicode каждый символ кодируется 16 битами. Определите информационный объём в байтах сообщения из 512 символов в этой кодировке.",
    "answer": "1024"
  },
  {
    "id": "577",
    "condition": "Рассказ, набранный на компьютере, содержит 2 страницы, на каждой странице 60 строк, в каждой строке 64 символа. Определите информационный объём рассказа в байтах в кодировке KOI8-R, в которой каждый символ кодируется 8 битами.",
    "answer": "7680"
  },
  {
    "id": "576",
    "condition": "Рассказ, набранный на компьютере, содержит 4 страницы, на каждой странице 48 строк, в каждой строке 64 символа. Определите информационный объём рассказа в Кбайтах в кодировке KOI8-R, в которой каждый символ кодируется 8 битами.",
    "answer": "12"
  },
  {
    "id": "575",
    "condition": "В одной из кодировок Unicode каждый символ кодируется 16 битами. Определите размер в байтах следующего предложения в данной кодировке: <br/><pre>Но так и быть! Судьбу мою отныне я тебе вручаю.</pre>",
    "answer": "94"
  },
  {
    "id": "574",
    "condition": "В одной из кодировок Unicode каждый символ кодируется 16 битами. Определите размер следующего предложения в байтах в данной кодировке: <br/><pre>Слух обо мне пройдёт по всей Руси великой.</pre>",
    "answer": "84"
  },
  {
    "id": "573",
    "condition": "В одной из кодировок Unicode каждый символ кодируется 16 битами. Определите размер следующего предложения в данной кодировке в байтах.<br/><pre>Я к вам пишу – чего же боле? Что я могу ещё сказать?</pre>",
    "answer": "104"
  }
]