[
  {
    "id": "8205",
    "condition": "(С. Сергеев) Ребята решили попробовать себя в картографии и нарисовали вот такую схему населенных пунктов. Буквами указаны названия населенных пунктов, а в таблице дано время пути по соответствующей дороге в минутах. Определите, за какое минимальное время можно добраться из населенного пункта A в пункт F в минутах.<br/><img src=\"8205.gif\"/>",
    "answer": "26"
  },
  {
    "id": "1195",
    "condition": "(О. Щецова) Между населёнными пунктами A, B, C, D, E, F построены дороги, протяжённость которых приведена в таблице. Отсутствие числа в таблице означает, что прямой дороги между пунктами нет. Определите длину кратчайшего пути между пунктами B и C, проходящего через пункт F. Передвигаться можно только по указанным дорогам. <br/><img src=\"1195.gif\"/>",
    "answer": "9"
  },
  {
    "id": "1194",
    "condition": "(О. Щецова) Между населёнными пунктами A, B, C, D, E, F построены дороги, протяжённость которых приведена в таблице. Отсутствие числа в таблице означает, что прямой дороги между пунктами нет. Определите длину кратчайшего пути между пунктами A и F, не проходящего через пункт E. Передвигаться можно только по указанным дорогам. <br/><img src=\"1194.gif\"/>",
    "answer": "15"
  },
  {
    "id": "1193",
    "condition": "(О. Щецова) Между населёнными пунктами A, B, C, D, E, F построены дороги, протяжённость которых приведена в таблице. Отсутствие числа в таблице означает, что прямой дороги между пунктами нет. Определите длину кратчайшего пути между пунктами A и F, проходящего через пункт E. Передвигаться можно только по указанным дорогам.<br/><img src=\"1193.gif\"/>",
    "answer": "12"
  },
  {
    "id": "1192",
    "condition": "(О. Щецова) Между населёнными пунктами A, B, C, D, E, F построены дороги, протяжённость которых приведена в таблице. Отсутствие числа в таблице означает, что прямой дороги между пунктами нет. Определите длину кратчайшего пути между пунктами A и B, проходящего через пункт D. Передвигаться можно только по указанным дорогам.<br/><img src=\"1192.gif\"/>Примечание: обратите внимание, что по условию не запрещено дважды проходить через один пункт.",
    "answer": "16"
  },
  {
    "id": "1191",
    "condition": "(О. Щецова) Между населёнными пунктами A, B, C, D, E, F построены дороги, протяжённость которых приведена в таблице. Отсутствие числа в таблице означает, что прямой дороги между пунктами нет. Определите длину кратчайшего пути между пунктами A и D, проходящего через пункт E. Передвигаться можно только по указанным дорогам.<br/><img src=\"1191.gif\"/>",
    "answer": "7"
  },
  {
    "id": "1190",
    "condition": "(О. Щецова) Между населёнными пунктами A, B, C, D, E, F построены дороги, протяжённость которых приведена в таблице. Отсутствие числа в таблице означает, что прямой дороги между пунктами нет. Определите длину кратчайшего пути между пунктами A и E, проходящего через пункт D. Передвигаться можно только по указанным дорогам.<br/><img src=\"1190.gif\"/>",
    "answer": "9"
  },
  {
    "id": "1189",
    "condition": "(О. Щецова) Между населёнными пунктами A, B, C, D, E, F, G построены дороги, протяжённость которых приведена в таблице. Отсутствие числа в таблице означает, что прямой дороги между пунктами нет. Определите длину кратчайшего пути между пунктами A и G, проходящего через пункт E (при условии, что передвигаться можно только по построенным дорогам). <br/><img src=\"1189.gif\"/>",
    "answer": "17"
  },
  {
    "id": "1188",
    "condition": "Между населёнными пунктами A, B, C, D, E, F построены дороги, протяжённость которых (в километрах) приведена в таблице. Определите длину кратчайшего пути между пунктами A и D, проходящего через пункт C. Передвигаться можно только по дорогам, протяжённость которых указана в таблице.<br/><img src=\"1188.gif\"/>",
    "answer": "8"
  },
  {
    "id": "1187",
    "condition": "Между населёнными пунктами A, B, C, D, E, F построены дороги, протяжённость которых (в километрах) приведена в таблице. Определите длину кратчайшего пути между пунктами A и F, проходящий через пункт D. Передвигаться можно только по дорогам, протяжённость которых указана в таблице.<br/><img src=\"1187.gif\"/>",
    "answer": "14"
  },
  {
    "id": "1186",
    "condition": "Между населёнными пунктами A, B, C, D, E, F построены дороги, протяжённость которых (в километрах) приведена в таблице. Определите длину кратчайшего пути между пунктами A и D, проходящего через пункт F. Передвигаться можно только по дорогам, протяжённость которых указана в таблице.<br/><img src=\"1186.gif\"/>",
    "answer": "12"
  },
  {
    "id": "1185",
    "condition": "Между населёнными пунктами A, B, C, D, E, F построены дороги, протяжённость которых (в километрах) приведена в таблице. Определите длину кратчайшего пути между пунктами A и D, проходящего через пункт F. Передвигаться можно только по дорогам, протяжённость которых указана в таблице.<br/><img src=\"1185.gif\"/>",
    "answer": "9"
  },
  {
    "id": "1184",
    "condition": "Между населёнными пунктами A, B, C, D, E, F построены дороги, протяжённость которых (в километрах) приведена в таблице. Определите длину кратчайшего пути между пунктами A и D, проходящего через пункт E. Передвигаться можно только по дорогам, протяжённость которых указана в таблице.<br/><img src=\"1184.gif\"/>",
    "answer": "7"
  },
  {
    "id": "1183",
    "condition": "Между населёнными пунктами A, B, C, D, E, F построены дороги, протяжённость которых (в километрах) приведена в таблице. Определите длину кратчайшего пути между пунктами A и F, проходящего через пункт C. Передвигаться можно только по дорогам, протяжённость которых указана в таблице.<br/><img src=\"1183.gif\"/>",
    "answer": "7"
  },
  {
    "id": "1182",
    "condition": "Между населёнными пунктами A, B, C, D, E, F построены дороги, протяжённость которых (в километрах) приведена в таблице. Определите длину кратчайшего пути между пунктами A и F, проходящего через пункт D. Передвигаться можно только по дорогам, протяжённость которых указана в таблице.<br/><img src=\"1182.gif\"/>",
    "answer": "9"
  },
  {
    "id": "1181",
    "condition": "Учительница Марья Петровна живёт на станции B, а работает на станции D. Чтобы успеть с утра на уроки, она должна ехать по самой короткой дороге. Проанализируйте таблицу и укажите длину кратчайшего пути от станции B до станции D.<br/><img src=\"1181.gif\"/>",
    "answer": "6"
  },
  {
    "id": "1180",
    "condition": "Учитель Иван Петрович живёт на станции A, а работает на станции D. Чтобы успеть с утра на уроки, он должен ехать по самой короткой дороге, но обязательно заехать на станцию C. Проанализируйте таблицу и укажите длину кратчайшего пути от станции A до станции D, проходящего через станцию C.<br/><img src=\"1180.gif\"/>",
    "answer": "4"
  },
  {
    "id": "1179",
    "condition": "Между населёнными пунктами A, B, C, D, E построены дороги, протяжённость которых (в километрах) приведена в таблице. Определите длину кратчайшего пути между пунктами A и D, проходящий через пункт E. Передвигаться можно только по дорогам, протяжённость которых указана в таблице.<br/><img src=\"1179.gif\"/>",
    "answer": "10"
  },
  {
    "id": "1178",
    "condition": "Между населёнными пунктами A, B, C, D, E построены дороги, протяжённость которых (в километрах) приведена в таблице. Определите длину кратчайшего пути между пунктами B и E, не проходящего через пункт D. Передвигаться можно только по дорогам, протяжённость которых указана в таблице.<br/><img src=\"1178.gif\"/>",
    "answer": "7"
  },
  {
    "id": "1177",
    "condition": "Между населёнными пунктами A, B, C, D, E построены дороги, протяжённость которых (в километрах) приведена в таблице. Определите длину кратчайшего пути между пунктами A и D, проходящего через пункт E. Передвигаться можно только по дорогам, протяжённость которых указана в таблице.<br/><img src=\"1177.gif\"/>",
    "answer": "10"
  },
  {
    "id": "1176",
    "condition": "Между населёнными пунктами A, B, C, D, E построены дороги, протяжённость которых (в километрах) приведена в таблице. Определите длину кратчайшего пути между пунктами B и E, не проходящего через пункт А. Передвигаться можно только по дорогам, протяжённость которых указана в таблице.<br/><img src=\"1176.gif\"/>",
    "answer": "10"
  },
  {
    "id": "1175",
    "condition": "Между населёнными пунктами A, B, C, D, E построены дороги, протяжённость которых (в километрах) приведена в таблице. Определите длину кратчайшего пути между пунктами A и Е, проходящего через пункт D. Передвигаться можно только по дорогам, протяжённость которых указана в таблице.<br/><img src=\"1175.gif\"/>",
    "answer": "6"
  },
  {
    "id": "1174",
    "condition": "Между населёнными пунктами A, B, C, D, E построены дороги, протяжённость которых (в километрах) приведена в таблице (см. рисунок). Определите длину кратчайшего пути между пунктами A и Е, проходящего через пункт С. Передвигаться можно только по дорогам, протяжённость которых указана в таблице.<br/><img src=\"1174.gif\"/>",
    "answer": "8"
  },
  {
    "id": "1173",
    "condition": "Между населёнными пунктами A, B, C, D построены дороги, протяжённость которых (в километрах) приведена в таблице. Определите длину кратчайшего пути между пунктами A и C, проходящего через пункт B. Передвигаться можно только по дорогам, протяжённость которых указана в таблице.<br/><img src=\"1173.gif\"/>",
    "answer": "5"
  }
]