[
  {
    "id": "8202",
    "condition": "(С. Сергеев) Арсену стало интересно, а сколько всего путей от левого верхнего до нижнего правого угла, если между узлами можно перемещаться только вправо или вниз?<br/><img src=\"8202.gif\"/>",
    "answer": "14"
  },
  {
    "id": "1283",
    "condition": "На рисунке – схема дорог, связывающих города A, B, C, D, E, F, G и H. По каждой дороге можно двигаться только в одном направлении, указанном стрелкой. Сколько существует различных путей из города A в город H, проходящих через город F?<br/><img src=\"1283.gif\"/>",
    "answer": "7"
  },
  {
    "id": "1282",
    "condition": "На рисунке – схема дорог, связывающих города A, B, C, D, E, F, G и H. По каждой дороге можно двигаться только в одном направлении, указанном стрелкой. Сколько существует различных путей из города A в город H?<br/><img src=\"1282.gif\"/>",
    "answer": "6"
  },
  {
    "id": "1281",
    "condition": "На рисунке – схема дорог, связывающих города A, B, C, D, E, F, G и H. По каждой дороге можно двигаться только в одном направлении, указанном стрелкой. Сколько существует различных путей из города A в город H, проходящих через город B?<br/><img src=\"1281.gif\"/>",
    "answer": "4"
  },
  {
    "id": "1280",
    "condition": "На рисунке – схема дорог, связывающих города A, B, C, D, E, F, G и H. По каждой дороге можно двигаться только в одном направлении, указанном стрелкой. Сколько существует различных путей из города A в город H, проходящих через город D?<br/><img src=\"1280.gif\"/>",
    "answer": "6"
  },
  {
    "id": "1279",
    "condition": "На рисунке – схема дорог, связывающих города A, B, C, D, E и F. По каждой дороге можно двигаться только в одном направлении, указанном стрелкой. Сколько существует различных путей из города A в город F, проходящих через город D?<br/><img src=\"1279.gif\"/>",
    "answer": "6"
  },
  {
    "id": "1278",
    "condition": "На рисунке – схема дорог, связывающих города A, B, C, D, E и F. По каждой дороге можно двигаться только в одном направлении, указанном стрелкой. Сколько существует различных путей из города A в город F, не проходящих через город Е?<br/><img src=\"1278.gif\"/>",
    "answer": "3"
  },
  {
    "id": "1277",
    "condition": "На рисунке – схема дорог, связывающих города А, Б, В, Г, Д, Е, Ж, З, И и К. По каждой дороге можно двигаться только в одном направлении, указанном стрелкой. Сколько существует различных путей из города А в город К, не проходящих через город Д?<br/><img src=\"1277.gif\"/>",
    "answer": "9"
  },
  {
    "id": "1276",
    "condition": "На рисунке – схема дорог, связывающих города А, Б, В, Г, Д, Е, Ж, З, И и К. По каждой дороге можно двигаться только в одном направлении, указанном стрелкой. Сколько существует различных путей из города А в город К, не проходящих через город Д?<br/><img src=\"1276.gif\"/>",
    "answer": "7"
  },
  {
    "id": "1275",
    "condition": "На рисунке – схема дорог, связывающих города A, B, C, D, E, F, G и H. По каждой дороге можно двигаться только в одном направлении, указанном стрелкой. Сколько существует различных путей из города A в город H, не проходящих через город D?<br/><img src=\"1275.gif\"/>",
    "answer": "5"
  },
  {
    "id": "1274",
    "condition": "На рисунке – схема дорог, связывающих города A, B, C, D, E, F и G. По каждой дороге можно двигаться только в одном направлении, указанном стрелкой. Сколько существует различных путей из города A в город H, не проходящих через город D?<br/><img src=\"1274.gif\"/>",
    "answer": "5"
  },
  {
    "id": "1273",
    "condition": "На рисунке – схема дорог, связывающих города A, B, C, D, E, F, G, H, I и J. По каждой дороге можно двигаться только в одном направлении, указанном стрелкой. Сколько существует различных путей из города A в город J, не проходящих через город D?<br/><img src=\"1273.gif\"/>",
    "answer": "10"
  },
  {
    "id": "1272",
    "condition": "На рисунке – схема дорог, связывающих города A, B, C, D, E, F, G, H, I и J. По каждой дороге можно двигаться только в одном направлении, указанном стрелкой. Сколько существует различных путей из города A в город J, не проходящих через город F?<br/><img src=\"1272.gif\"/>",
    "answer": "8"
  },
  {
    "id": "1271",
    "condition": "На рисунке – схема дорог, связывающих города А, Б, В, Г, Д, Е, Ж, З, И, К и Л. По каждой дороге можно двигаться только в одном направлении, указанном стрелкой. Сколько существует различных путей из города А в город Л, не проходящих через город В?<br/><img src=\"1271.gif\"/>",
    "answer": "13"
  },
  {
    "id": "1270",
    "condition": "На рисунке – схема дорог, связывающих города A, B, C, D, E, F и G. По каждой дороге можно двигаться только в одном направлении, указанном стрелкой. Сколько существует различных путей из города A в город G, проходящих через город D?<br/><img src=\"1270.gif\"/>",
    "answer": "3"
  },
  {
    "id": "1269",
    "condition": "На рисунке – схема дорог, связывающих города А, Б, В, Г, Д, Е, Ж и К. По каждой дороге можно двигаться только в одном направлении, указанном стрелкой. Сколько существует различных путей из города А в город К, проходящих через город B?<br/><img src=\"1269.gif\"/>",
    "answer": "4"
  },
  {
    "id": "1268",
    "condition": "На рисунке – схема дорог, связывающих города A, B, C, D, E, F, G и H. По каждой дороге можно двигаться только в одном направлении, указанном стрелкой. Сколько существует различных путей из города A в город H, проходящих через город C?<br/><img src=\"1268.gif\"/>",
    "answer": "4"
  },
  {
    "id": "1267",
    "condition": "На рисунке – схема дорог, связывающих города А, Б, В, Г, Д, Е, Ж, З, И, К и Л. По каждой дороге можно двигаться только в одном направлении, указанном стрелкой. Сколько существует различных путей из города А в город Л, проходящих через город Г?<br/><img src=\"1267.gif\"/>",
    "answer": "6"
  },
  {
    "id": "1266",
    "condition": "На рисунке – схема дорог, связывающих города А, Б, В, Г, Д, Е, Ж и К. По каждой дороге можно двигаться только в одном направлении, указанном стрелкой. Сколько существует различных путей из города А в город К, проходящих через город В?<br/><img src=\"1266.gif\"/>",
    "answer": "6"
  },
  {
    "id": "1265",
    "condition": "На рисунке – схема дорог, связывающих города A, B, C, D, E, F и G. По каждой дороге можно двигаться только в одном направлении, указанном стрелкой. Сколько существует различных путей из города A в город G, проходящих через город B?<br/><img src=\"1265.gif\"/>",
    "answer": "6"
  },
  {
    "id": "1264",
    "condition": "На рисунке – схема дорог, связывающих города А, Б, В, Г, Д, Е, Ж и К. По каждой дороге можно двигаться только в одном направлении, указанном стрелкой. Сколько существует различных путей из города А в город К, проходящих через город В?<br/><img src=\"1264.gif\"/>",
    "answer": "4"
  },
  {
    "id": "1263",
    "condition": "На рисунке – схема дорог, связывающих города А, Б, В, Г, Д, Е, Ж, З, И, К и Л. По каждой дороге можно двигаться только в одном направлении, указанном стрелкой. Сколько существует различных путей из города А в город Л, проходящих через город В?<br/><img src=\"1263.gif\"/>",
    "answer": "10"
  },
  {
    "id": "1262",
    "condition": "На рисунке – схема дорог, связывающих города А, Б, В, Г, Д, Е, Ж, З, И, К и Л. По каждой дороге можно двигаться только в одном направлении, указанном стрелкой. Сколько существует различных путей из города А в город Л, проходящих через город В?<br/><img src=\"1262.gif\"/>",
    "answer": "10"
  },
  {
    "id": "1261",
    "condition": "На рисунке – схема дорог, связывающих города А, Б, В, Г, Д, Е, Ж и К. По каждой дороге можно двигаться только в одном направлении, указанном стрелкой. Сколько существует различных путей из города А в город К, проходящих через город Г?<br/><img src=\"1261.gif\"/>",
    "answer": "8"
  }
]